using System.Collections.Generic;
using System.ComponentModel;
using Exiled.API.Enums;
using Exiled.API.Interfaces;
using PlayerRoles;
using VenterModuleExiled.Subroles;

namespace VenterModuleExiled
{
    internal class Config : IConfig
    {
        public bool IsEnabled { get; set; } = true;
        public bool Debug { get; set; } = false;

        [Description("Двери которые будут заблокированы при начале дня")]
        public HashSet<DoorType> LockDoors { get; set; } = new() { DoorType.GateA, DoorType.GateB, DoorType.Scp049Gate, DoorType.Scp173Gate, DoorType.Scp173NewGate, DoorType.Scp914Gate };

        [Description("Список имен")]
        public List<string> NamesList { get; set; } = new() { "Александр", "Адам", "Алексей", "Альбин", "Анатолий", "Александр", "Андрей", "Альфред", "Антон", "Андерс", "Аркадий", "Андреас", "Арсений", "Антон", "Артем", "Арвид", "Борис", "Аксель", "Вадим", "Бенгт", "Валентин", "Беньямин", "Валерий", "Бертиль", "Василий", "Бьёрн", "Виктор", "Бу", "Виталий", "Карл", "Владимир", "Кристер", "Владислав", "Давид", "Всеволод", "Даниель", "Геннадий", "Эмиль", "Георгий", "Эрик", "Глеб", "Фредрик", "Григорий", "Гуннар", "Даниил", "Ханс", "Денис", "Харальд", "Дмитрий", "Хенрик", "Евгений", "Ингвар", "Егор", "Ингемар", "Иван", "Ингве", "Игорь", "Якоб", "Илья", "Ян", "Кирилл", "Йохан", "Константин", "Йоран", "Лев", "Йорген", "Леонид", "Юнас", "Максим", "Юхан", "Матвей", "Калле", "Михаил", "Карл", "Никита", "Клас", "Николай", "Кнут", "Олег", "Ларс", "Павел", "Леннарт", "Петр", "Ларс", "Роман", "Лейф", "Руслан", "Магнус", "Семен", "Маркус", "Сергей", "Мартин", "Станислав", "Матс", "Степан", "Микаэль", "Тимофей", "Никлас", "Тимур", "Улоф", "Федор", "Ульрик", "Филипп", "Ульф", "Эдуард", "Оке", "Юрий", "Ола", "Ярослав", "Оскар", "Артур", "Пер", "Валерий", "Петер", "Вячеслав", "Расмус", "Геннадий", "Роберт", "Герман", "Роланд", "Дмитрий", "Руне", "Евгений", "Сигурд", "Захар", "Стен", "Игнат", "Стиг", "Иосиф", "Свен", "Кузьма", "Томас", "Лаврентий", "Торбьёрн", "Марат", "Торд", "Назар", "Торстен", "Остап", "Туре", "Платон", "Уве", "Прохор", "Вильгельм", "Родион", "Вальдемар", "Ростислав", "Альберт", "Савелий", "Бруно", "Святослав", "Вальтер", "Семен", "Виктор", "Тарас", "Георг", "Тимофей", "Густав", "Тихон", "Харальд", "Федот", "Хельге", "Харитон", "Эйнар", "Эдуард", "Эрик", "Юлиан", "Эрнст", "Яков", "Юхан" };

        [Description("Список фамилий")]
        public List<string> SnamesList { get; set; } = new() { "Иванов", "Андерссон", "Петров", "Йоханссон", "Сидоров", "Карлссон", "Смирнов", "Нильссон", "Кузнецов", "Эрикссон", "Попов", "Ларссон", "Васильев", "Ульссон", "Соколов", "Густафссон", "Михайлов", "Перссон", "Новиков", "Свенссон", "Федоров", "Петерссон", "Морозов", "Ольссон", "Волков", "Энгстрём", "Алексеев", "Линдгрен", "Лебедев", "Бергстрём", "Семенов", "Хольм", "Егоров", "Фредрикссон", "Павлов", "Сандберг", "Козлов", "Хенрикссон", "Степанов", "Лундберг", "Николаев", "Орлов", "Бьёрк", "Андреев", "Экелунд", "Макаров", "Фальк", "Никитин", "Дальстрём", "Захаров", "Берг", "Зайцев", "Нюстрём", "Соловьев", "Лундгрен", "Борисов", "Оскарссон", "Яковлев", "Стрём", "Григорьев", "Абрахамссон", "Романов", "Моберг", "Воробьев", "Видегрен", "Сергеев", "Линдквист", "Кириллов", "Аксельссон", "Максимов", "Магнуссон", "Белов", "Блум", "Калинин", "Кнутссон", "Герасимов", "Линдхольм", "Поляков", "Нордстрём", "Цветков", "Саломонссон", "Данилов", "Сундберг", "Жуков", "Элиассон", "Фролов", "Лундстрём", "Осипов", "Баклунд", "Константинов", "Валлин", "Виноградов", "Грен", "Комаров", "Сёдерберг", "Дмитриев", "Альм", "Королев", "Хагстрём", "Гусев", "Ферм", "Крылов", "Линд", "Титов", "Лёфстрем", "Кузьмин", "Экхольм", "Тихонов", "Линдстрем", "Савельев", "Мелин", "Рыбаков", "Хольмстрем", "Суханов", "Бенгтссон", "Ефимов", "Вестерлунд", "Медведев", "Юнг", "Тарасов", "Эстлунд", "Богданов", "Форсберг" };

        [Description("Список позывных")]
        public List<string> CallSigns { get; set; } = new() { "Алмаз", "Берсерк", "Варяг", "Волк", "Вулкан", "Гром", "Гризли", "Дозор", "Дунай", "Зенит", "Икар", "Кедр", "Командор", "Кондор", "Корсар", "Кристалл", "Лорд", "Максимус", "Меркурий", "Минотавр", "Молот", "Монолит", "Немо", "Нестор", "Орион", "Охотник", "Патриот", "Пеликан", "Пилот", "Пиранья", "Полярник", "Посейдон", "Призрак", "Пророк", "Райдер", "Радар", "Рамбо", "Ранго", "Рейнджер", "Рок", "Ронин", "Рубеж", "Сапсан", "Саттел", "Скаут", "Скальпель", "Скорпион", "Сокол", "Спартанец", "Сталкер", "Стикс", "Страж", "Стриж", "Тайфун", "Танк", "Титан", "Топаз", "Торнадо", "Триггер", "Ураган", "Утес", "Факел", "Фантом", "Феникс", "Фобос", "Форт", "Хакер", "Хищник", "Центурион", "Цитадель", "Шахтер", "Шериф", "Шквал", "Шторм", "Эклипс", "Эльбрус", "Эфир", "Юпитер", "Ягуар", "Ястреб", "Барс", "Вепрь", "Гепард", "Гидра", "Дозорный", "Змей", "Кайзер", "Каратель", "Кобра", "Колосс", "Корсар", "Левиафан", "Мангуст", "Механик", "Ниндзя", "Орел", "Патриарх", "Проводник", "Скала", "Снайпер", "Тень", "Шериф", "Бинго", "Дельта", "Стервятник" };

        [Description("CASSIE о начале рабочего дня")]
        public string RoundStartCassie { get; set; } = "";

        [Description("CASSIE при НОУС'е")]
        public string SoloBreachCassie { get; set; } = "%scp%";

        [Description("CASSIE при мНОУС'е")]
        public string ManyBreachCassie { get; set; } = "";

        [Description("SCP : Здоровье")]
        public Dictionary<RoleTypeId, int> ScpHealth { get; set; } = new()
        {
            { RoleTypeId.Scp049, 200 },
            { RoleTypeId.Scp106, 65565 },
            { RoleTypeId.Scp939, 3500 },
        };

        [Description("CASSIE о назначении на арест за кражу объекта")]
        public string StealScpArestCassie { get; set; } = "%id% %scp%";

        [Description("CASSIE при прибытии гвардии")]
        public string TacticalGroupCassie { get; set; } = "";

        [Description("CASSIE при прибытии ПХ")]
        public string ChaosCassie { get; set; } = "";

        [Description("Дополнительное здоровье от каждого типа брони")]
        public Dictionary<ItemType, int> ArmorAhp { get; set; } = new()
        {
            {ItemType.ArmorLight, 10},
            {ItemType.ArmorCombat, 20},
            {ItemType.ArmorHeavy, 30},
        };
    }
}
